In [2]:
import pandas as pd
s1 = pd.Series([5,6,8,9])
s2 = pd.Series([10,14,56])
pd.concat([s1,s2],axis =1)

   0     1
0  5  10.0
1  6  14.0
2  8  56.0
3  9   NaN

In [6]:
fruits = pd.Series(data = ["Apple", "Banana", "Cheery", "Pineapple"],
                  index=["a", "b", "c", "d"])


animals = pd.Series(data=["Cow", "Hen", "Lion", "Elk","Pica"],
                   index = ["b", "c", "a","e","p"])

In [8]:
pd.concat([animals,fruits])

b          Cow
c          Hen
a         Lion
e          Elk
p         Pica
a        Apple
b       Banana
c       Cheery
d    Pineapple
dtype: object

In [12]:
pd.concat([animals,fruits],axis=1, join="inner")

      0       1
b   Cow  Banana
c   Hen  Cheery
a  Lion   Apple